fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Плановые отпуска сотрудников на год.</comment>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <comment>Год, на который составлен график.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ЗапланированныеОтпуска/ВКМ_ЗапланированныеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ЗапланированныеОтпуска</name>
  <comment>Плановые дни отпуска по графику. Нужен для отчета о расходе запланированных отпусков: отчеты строятся по регистрам, а не по документам.</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = СтрокаОтпуска.ДатаНачала;
		Движение.Сотрудник = СтрокаОтпуска.Сотрудник;
		Движение.ДнейОтпуска = ВКМ_ДнейОтпуска(СтрокаОтпуска);
		
	КонецЦикла;
	
	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		
		Если СтрокаОтпуска.ДатаОкончания < СтрокаОтпуска.ДатаНачала Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 дата окончания отпуска раньше даты начала.'"),
				СтрокаОтпуска.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,
				"ОтпускаСотрудников[" + (СтрокаОтпуска.НомерСтроки - 1) + "].ДатаОкончания",
				, Отказ);
		КонецЕсли;
		
		Если Год(СтрокаОтпуска.ДатаНачала) <> Год Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 отпуск начинается вне года графика.'"),
				СтрокаОтпуска.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,
				"ОтпускаСотрудников[" + (СтрокаОтпуска.НомерСтроки - 1) + "].ДатаНачала",
				, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает длительность отпуска в календарных днях, включая обе границы.
//
// Параметры:
//  СтрокаОтпуска - СтрокаТабличнойЧастиДокумента.ВКМ_ГрафикОтпусков.ОтпускаСотрудников - строка графика.
//
// Возвращаемое значение:
//  Число - количество календарных дней отпуска.
//
Функция ВКМ_ДнейОтпуска(СтрокаОтпуска)
	
	Если Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
		Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Цел((НачалоДня(СтрокаОтпуска.ДатаОкончания)
		- НачалоДня(СтрокаОтпуска.ДатаНачала)) / 86400) + 1;
	
КонецФункции

#КонецОбласти

#КонецЕсли
